IDEA Open Model
OpenMessage Class
Compatible with IDEA StatiCa 20.1
 Open message base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Message.OpenMessage
 IdeaRS.OpenModel.Message.ErrorMessage
 IdeaRS.OpenModel.Message.InformationMessage
 IdeaRS.OpenModel.Message.WarningMessage
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class OpenMessage : OpenObject
Public Class OpenMessage
	Inherits OpenObject
The OpenMessage type exposes the following members.
Constructors
Name | Description
OpenMessage
 Constructor
Top
Properties
Name | Description
Description
 Description of message
InnerMessage
 Inner message
Message
 Gets the Message
Number
 Number of message
Object
 Affected object
PropertyName
 Affected property name
PropertyValue
 Gets the value of affected property
Top
Methods
Name | Description
Create
 Creating message
Top
See Also
Reference
IdeaRS.OpenModel.Message Namespace